Revit 2027 API
IFrameworkElementCreator.CreateFrameworkElement Method
 Method called to create the FrameworkElement.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
FrameworkElement CreateFrameworkElement()
Function CreateFrameworkElement As FrameworkElement
FrameworkElement^ CreateFrameworkElement()
abstract CreateFrameworkElement : unit -> FrameworkElement
Return Value
FrameworkElement
See Also
Reference
IFrameworkElementCreator Interface
Autodesk.Revit.UI Namespace